src/testing/performance-test/test-case2/32gb/siege-300-users-pc.txt
[alert] Zip encoding disabled; siege requires zlib support to enable it
[error] CONFIG conflict: selected time and repetition based testing
defaulting to time-based testing: 120 seconds
** SIEGE 4.0.2
** Preparing 255 concurrent users for battle.
The server is now under siege...
Lifting the server siege...
Transactions:		        2212 hits
Availability:		       68.55 %
Elapsed time:		      119.97 secs
Data transferred:	      348.52 MB
Response time:		        5.51 secs
Transaction rate:	       18.44 trans/sec
Throughput:		        2.91 MB/sec
Concurrency:		      101.68
Successful transactions:        3227
Failed transactions:	        1015
Longest transaction:	       64.44
Shortest transaction:	        0.00
 

================================================================
WARNING: The number of users is capped at 255.  To increase this
         limit, search your .siegerc file for 'limit' and change
         its value. Make sure you read the instructions there...
================================================================
Aborted